Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAB176.atdf
         <register caption="ADC Early Interrupt Status Register 2" name="ADCEISTAT2" offset="0xfc" rw="R" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 32" mask="0x00000001" name="EIRDY32" values="ADCEISTAT2__EIRDY32" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 33" mask="0x00000002" name="EIRDY33" values="ADCEISTAT2__EIRDY33" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 34" mask="0x00000004" name="EIRDY34" values="ADCEISTAT2__EIRDY34" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 35" mask="0x00000008" name="EIRDY35" values="ADCEISTAT2__EIRDY35" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 36" mask="0x00000010" name="EIRDY36" values="ADCEISTAT2__EIRDY36" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 37" mask="0x00000020" name="EIRDY37" values="ADCEISTAT2__EIRDY37" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 38" mask="0x00000040" name="EIRDY38" values="ADCEISTAT2__EIRDY38" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 39" mask="0x00000080" name="EIRDY39" values="ADCEISTAT2__EIRDY39" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 40" mask="0x00000100" name="EIRDY40" values="ADCEISTAT2__EIRDY40" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 41" mask="0x00000200" name="EIRDY41" values="ADCEISTAT2__EIRDY41" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 42" mask="0x00000400" name="EIRDY42" values="ADCEISTAT2__EIRDY42" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 43" mask="0x00000800" name="EIRDY43" values="ADCEISTAT2__EIRDY43" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bit 44" mask="0x00001000" name="EIRDY44" values="ADCEISTAT2__EIRDY44" />
            <bitfield mask="0x00002000" name="EIRDY45" />
            <bitfield mask="0x00004000" name="EIRDY46" />
            <bitfield mask="0x00008000" name="EIRDY47" />
            <bitfield mask="0x00010000" name="EIRDY48" />
            <bitfield mask="0x00020000" name="EIRDY49" />
            <bitfield mask="0x00040000" name="EIRDY50" />
            <bitfield mask="0x00080000" name="EIRDY51" />
            <bitfield mask="0x00100000" name="EIRDY52" />
            <bitfield mask="0x00200000" name="EIRDY53" />
            <bitfield mask="0x00400000" name="EIRDY54" />
            <bitfield mask="0x00800000" name="EIRDY55" />
            <bitfield mask="0x01000000" name="EIRDY56" />
            <bitfield mask="0x02000000" name="EIRDY57" />
            <bitfield mask="0x04000000" name="EIRDY58" />
            <bitfield mask="0x08000000" name="EIRDY59" />
            <bitfield mask="0x10000000" name="EIRDY60" />
            <bitfield mask="0x20000000" name="EIRDY61" />
            <bitfield mask="0x40000000" name="EIRDY62" />
            <bitfield mask="0x80000000" name="EIRDY63" />
         </register>
         <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x100" rw="RW" size="4">
            <bitfield caption="ADC0 Analog and Bias Circuitry Enable bit" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0" />
            <bitfield caption="ADC1 Analog and Bias Circuitry Enable bit" mask="0x00000002" name="ANEN1" values="ADCANCON__ANEN1" />
            <bitfield caption="ADC2 Analog and Bias Circuitry Enable bit" mask="0x00000004" name="ANEN2" values="ADCANCON__ANEN2" />
            <bitfield caption="ADC3 Analog and Bias Circuitry Enable bit" mask="0x00000008" name="ANEN3" values="ADCANCON__ANEN3" />
            <bitfield caption="ADC4 Analog and Bias Circuitry Enable bit" mask="0x00000010" name="ANEN4" values="ADCANCON__ANEN4" />
            <bitfield mask="0x00000020" name="ANEN5" />
            <bitfield mask="0x00000040" name="ANEN6" />
            <bitfield caption="Shared ADC Analog and Bias Circuitry Enable bit" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7" />
            <bitfield caption="ADC 0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0" />
            <bitfield caption="ADC 1 Wake-up Status bit" mask="0x00000200" name="WKRDY1" values="ADCANCON__WKRDY1" />
            <bitfield caption="ADC 2 Wake-up Status bit" mask="0x00000400" name="WKRDY2" values="ADCANCON__WKRDY2" />
            <bitfield caption="ADC 3 Wake-up Status bit" mask="0x00000800" name="WKRDY3" values="ADCANCON__WKRDY3" />
            <bitfield caption="ADC 4 Wake-up Status bit" mask="0x00001000" name="WKRDY4" values="ADCANCON__WKRDY4" />
            <bitfield mask="0x00002000" name="WKRDY5" />
            <bitfield mask="0x00004000" name="WKRDY6" />
            <bitfield caption="Shared ADC Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7" />
            <bitfield caption="ADC 0 Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0" />
            <bitfield caption="ADC 1 Wake-up Interrupt Enable bit" mask="0x00020000" name="WKIEN1" values="ADCANCON__WKIEN1" />
            <bitfield caption="ADC 2 Wake-up Interrupt Enable bit" mask="0x00040000" name="WKIEN2" values="ADCANCON__WKIEN2" />
            <bitfield caption="ADC 3 Wake-up Interrupt Enable bit" mask="0x00080000" name="WKIEN3" values="ADCANCON__WKIEN3" />
            <bitfield caption="ADC 4 Wake-up Interrupt Enable bit" mask="0x00100000" name="WKIEN4" values="ADCANCON__WKIEN4" />
            <bitfield mask="0x00200000" name="WKIEN5" />
            <bitfield mask="0x00400000" name="WKIEN6" />
            <bitfield caption="Shared ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7" />
            <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT" />
         </register>
