Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAB176.atdf
      <value-group caption="EBI Address Pin Enable bit 14" name="CFGEBIA__EBIA14EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 15" name="CFGEBIA__EBIA15EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 16" name="CFGEBIA__EBIA16EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 17" name="CFGEBIA__EBIA17EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 18" name="CFGEBIA__EBIA18EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 19" name="CFGEBIA__EBIA19EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 20" name="CFGEBIA__EBIA20EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 21" name="CFGEBIA__EBIA21EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 22" name="CFGEBIA__EBIA22EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Address Pin Enable bit 23" name="CFGEBIA__EBIA23EN">
         <value caption="EBIAx pin is enabled for use by EBI" name="" value="0x1" />
         <value caption="EBIAx pin has is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Data Upper Byte Pin Enable bit" name="CFGEBIC__EBIDEN0">
         <value caption="EBID pins are enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBID pins have reverted to general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBI Data Upper Byte Pin Enable bit" name="CFGEBIC__EBIDEN1">
         <value caption="EBID pins are enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBID pins have reverted to general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS0 Pin Enable bit" name="CFGEBIC__EBICSEN0">
         <value caption="EBICS0 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS0 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS1 Pin Enable bit" name="CFGEBIC__EBICSEN1">
         <value caption="EBICS1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS2 Pin Enable bit" name="CFGEBIC__EBICSEN2">
         <value caption="EBICS2 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS2 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBICS3 Pin Enable bit" name="CFGEBIC__EBICSEN3">
         <value caption="EBICS3 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBICS3 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIBS0 Pin Enable bit" name="CFGEBIC__EBIBSEN0">
         <value caption="EBIBS0 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIBS0 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIBS1 Pin Enable bit" name="CFGEBIC__EBIBSEN1">
         <value caption="EBIBS1 pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIBS1 pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIOE Pin Enable bit" name="CFGEBIC__EBIOEEN">
         <value caption="EBIOE pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIOE pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIWE Pin Enable bit" name="CFGEBIC__EBIWEEN">
         <value caption="EBIWE pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIWE pin is available for general use" name="" value="0x0" />
      </value-group>
      <value-group caption="EBIRP Pin Sensitivity Control bit" name="CFGEBIC__EBIRPEN">
         <value caption="EBIRP pin is enabled for use by the EBI module" name="" value="0x1" />
         <value caption="EBIRP pin is available for general use" name="" value="0x0" />
      </value-group>
